# YOLOv12x-seg with DINOv3 ViT-B/16 Single-Scale Integration - EXTRA LARGE SEGMENTATION VERSION
# Channel flow follows standard YOLOv12x exactly, with DINO at P4 level and Segment head
# Based on standard yolov12.yaml with proper scaling

nc: 80  # number of classes
scale: x  # force extra large scale

scales: # model compound scaling constants (from standard yolov12.yaml)
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]   # YOLOv12n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.50, 0.50, 1024]   # YOLOv12s summary: 225 layers, 11166560 parameters, 11166544 gradients,  29.7 GFLOPs
  m: [0.50, 1.00, 512]    # YOLOv12m summary: 295 layers, 21172000 parameters, 21171984 gradients,  48.5 GFLOPs
  l: [1.00, 1.00, 512]    # YOLOv12l summary: 365 layers, 43691520 parameters, 43691504 gradients,  86.9 GFLOPs
  x: [1.00, 1.50, 512]    # YOLOv12x summary: 365 layers, 68229648 parameters, 68229632 gradients, 135.4 GFLOPs

backbone:
  # [from, repeats, module, args]
  # Standard YOLOv12x backbone - EXACT copy from yolov12.yaml with DINO insertion at P4
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 (3→96 channels with x scaling 1.5)
  - [-1, 1, Conv, [128, 3, 2, 1, 2]] # 1-P2/4 (96→192 channels with x scaling 1.5)
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 (192→384 channels with x scaling 1.5)
  - [-1, 1, Conv, [256, 3, 2, 1, 4]] # 3-P3/8 (384→384 channels with x scaling 1.5)
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 (384→768 channels with x scaling 1.5)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16 (768→768 channels with x scaling)
  - [-1, 4, A2C2f, [512, True, 4]]  # 6: Standard P4 (768→768 channels with x scaling)
  
  # DINO3 integration at P4 level - maintain exact same channel count
  - [-1, 1, DINO3Backbone, ['dinov3_vitb16', False, 768]]  # 7: DINO enhanced P4 (768→768 channels)
  
  # Continue standard YOLOv12x backbone
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32 (768→512 channels with x max_channels=512)
  - [-1, 4, A2C2f, [1024, True, 1]]  # 9: Standard P5 (512→512 channels with x scaling)

# Standard YOLOv12x head with Segment head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (512→512 channels)
  - [[-1, 7], 1, Concat, [1]] # 11: cat backbone P4 enhanced (512+768=1280 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 12 (1280→768 channels with x scaling)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (768→768 channels)
  - [[-1, 4], 1, Concat, [1]] # 14: cat backbone P3 (768+768=1536 channels)  
  - [-1, 2, A2C2f, [256, False, -1]] # 15: P3/8-small (1536→384 channels with x scaling 1.5)

  - [-1, 1, Conv, [256, 3, 2]] # 16 (384→384 channels with x scaling 1.5)
  - [[-1, 12], 1, Concat, [1]] # 17: cat head P4 (384+768=1152 channels)
  - [-1, 2, A2C2f, [512, False, -1]] # 18: P4/16-medium (1152→768 channels with x scaling)

  - [-1, 1, Conv, [512, 3, 2]] # 19 (768→768 channels with x scaling)
  - [[-1, 9], 1, Concat, [1]] # 20: cat head P5 (768+512=1280 channels)
  - [-1, 2, C3k2, [1024, True]] # 21: P5/32-large (1280→512 channels with x scaling)

  - [[15, 18, 21], 1, Segment, [nc, 32, 256]] # 22: Segment(P3=384, P4=768, P5=512)